
package entity;

public class Employee {
    public String fullname;
    public double salary;
    public Employee (String fullname, double salary) {
        this.fullname = fullname;
        this.salary = salary;
    }

    //Создать класс Employee, у которого есть переменные класса - fullname, salary. +
    //Создать массив содержащий несколько объектов этого типа. +
    //Создать класс Report  со статическим методом generateReport, в котором выводится информация о зарплате всех сотрудников.
    //Используйте форматирование строк. Пусть salary будет выровнено по правому краю,
    // десятичное значение имеет 2 знака после запятой и можете добавить что-нибудь свое.
    //String word = "string";
    //        String middleChars = getMiddleCharacters(word);
    //        System.out.println("Средние символы: " + middleChars)
    //public static void printStudentInfo(String lastName, int mark, String subject) {
    //        String result = String.format("Студент %-15s получил %-3d по %-10s", lastName, mark, subject);
    //        System.out.println(result);
}
